<img src= "MSTS_Logo.png" style ="width:400px;height:400px"/>

## Pandas
Pandas is another open source library  allowing us to manipulate data easily. DataFrame objects are the key to pandas and they help us organize, rearrange and visualize data.

Pandas is probably the most important library you can learn. The great part about it is that it can be used for data analysis in so many diffrent contexts, so feel free to apply anything you learn here to automating tasks in all other projects you have got going on!

## Import Statement
The statement used to import pandas is by convention

In [7]:
import pandas as pd

## Series
A series is a pandas data type. It is very similar to a numpy array and you can think about it as a list. A series though can have axis labels instead of just number locations.

You can think of a series as a list you could order or sort for now.

In [3]:
import numpy as np

In [5]:
indexes = ['one','two','three']
a_list = [10,20,30]
a_array = np.array([10,20,30])
dictionary_1 = {'a':10,'b':20,'c':100}

In [8]:
#To create a series, pass in the list and the labels you want for each list
pd.Series(a_list,index=indexes)

one      10
two      20
three    30
dtype: int64

In [11]:
#You can pass in a numpy array as well for the same result
pd.Series(a_array, index = indexes)

one      10
two      20
three    30
dtype: int64

In [13]:
#Same result here, it assumes the argument you are passing
pd.Series(a_array,indexes)

one      10
two      20
three    30
dtype: int64

In [15]:
#You can specify what your data is and it will index it for you
pd.Series(data = a_list)

0    10
1    20
2    30
dtype: int64

In [12]:
#You could even pass in functions
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
#Lets create an example series
stocks1 = pd.Series([100,200,300,400], index = ['StockA','StockB','StockC','StockD'])
stocks1

StockA    100
StockB    200
StockC    300
StockD    400
dtype: int64

In [18]:
#Access a value for your label
stocks1['StockB']

200

In [16]:
stocks2 = pd.Series([100,200,300,400], index = ['StockA','StockB','StockC','StockD'])

In [17]:
#You can execute operations between Series as well
#If they have the same index the values will be calculated accordingly
stocks1+stocks2

StockA    200
StockB    400
StockC    600
StockD    800
dtype: int64

In [21]:
#Labels that are not the same will show NA
stocks3 = pd.Series([100,200,300,400], index = ['StockZ','StockB','StockC','StockD'])
stocks1/stocks3

StockA    NaN
StockB    1.0
StockC    1.0
StockD    1.0
StockZ    NaN
dtype: float64

In [ ]:
#Documentation access

In [ ]:
#Tip : Type "pd.Series + (Shift+tab)" to see the pandas documentation for the method
pd.Series

---

## DataFrames
If Pandas is THE python library, then dataframes are THE datatype you want to understand. This data type is the foundation for backtesting nearly **any** trading strategy is Python.

DataFrames are key to analyzing data in Pandas, they are built on top of the Series object. If Series are just columns, then think of dataframes as tables : a bunch of columns fit together. and indexed correctly.

In [22]:
import pandas as pd
import numpy as np

In [23]:
from numpy.random import randn

In [28]:
#Setting a seed takes the randomness out of your random numbers effectively
np.random.seed(10)

In [ ]:
#First things first, use (Shift+tab) to view documentation
pd.DataFrame

In [29]:
#Notice the first three arguments are data, index, columns, lets create a df
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [32]:
#note:
randn(5,4)

array([[-1.97772828, -1.7433723 ,  0.26607016,  2.38496733],
       [ 1.12369125,  1.67262221,  0.09914922,  1.39799638],
       [-0.27124799,  0.61320418, -0.26731719, -0.54930901],
       [ 0.1327083 , -0.47614201,  1.30847308,  0.19501328],
       [ 0.40020999, -0.33763234,  1.25647226, -0.7319695 ]])

In [33]:
#A dataframe is basically just a bunch of series objects with the same index
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [34]:
df[['W']]

          W
A  1.331587
B  0.621336
C  0.004291
D -0.965066
E -1.136602

In [26]:
type(df['W'])

pandas.core.series.Series

In [35]:
df[['W']]

          W
A  1.331587
B  0.621336
C  0.004291
D -0.965066
E -1.136602

In [39]:
type(df[['W']])

pandas.core.frame.DataFrame

In [40]:
#Why the above diffrence? You are not calling the same object
#To simplify your life, think of the second way as extracting a dataframe from your df

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [43]:
#Create new columns
df['new_col'] = df['W']+df['Z']
df['new'] = df['W'] = df['Z']

In [44]:
df

          W         X         Y         Z       new   new_col
A -0.008384  0.715279 -1.545400 -0.008384 -0.008384 -0.016768
B  0.108549 -0.720086  0.265512  0.108549  0.108549  0.217097
C  1.203037 -0.174600  0.433026  1.203037  1.203037  2.406075
D  0.445138  1.028274  0.228630  0.445138  0.445138  0.890275
E -1.079805  0.135137  1.484537 -1.079805 -1.079805 -2.159610

In [33]:
#To delete a column you need to specify that you want to delete a column
df.drop('W',axis = 1)

          X         Y         Z       new
A  0.628133  0.907969  0.503826  0.503826
B -0.319318 -0.848077  0.605965  0.605965
C  0.740122  0.528813 -0.589001 -0.589001
D -0.758872 -0.933237  0.955057  0.955057
E  1.978757  2.605967  0.683509  0.683509

In [45]:
#If you want to drop a column permanently you need to specify the inplace argument
df.drop('W',axis = 1, inplace = True)

In [46]:
#Since the default is 0, you would drop a row if you didnt specify the axis
df.drop('B')

          X         Y         Z       new   new_col
A  0.715279 -1.545400 -0.008384 -0.008384 -0.016768
C -0.174600  0.433026  1.203037  1.203037  2.406075
D  1.028274  0.228630  0.445138  0.445138  0.890275
E  0.135137  1.484537 -1.079805 -1.079805 -2.159610

In [47]:
df
#Notice since we didnt use the inplace argument our changes didnt affect df

          X         Y         Z       new   new_col
A  0.715279 -1.545400 -0.008384 -0.008384 -0.016768
B -0.720086  0.265512  0.108549  0.108549  0.217097
C -0.174600  0.433026  1.203037  1.203037  2.406075
D  1.028274  0.228630  0.445138  0.445138  0.890275
E  0.135137  1.484537 -1.079805 -1.079805 -2.159610

In [49]:
# Selecting Rows : Use loc (locate) to find a row using its row label
df.loc['B':'C']

          X         Y         Z       new   new_col
B -0.720086  0.265512  0.108549  0.108549  0.217097
C -0.174600  0.433026  1.203037  1.203037  2.406075

In [50]:
#loc stands for location
df.loc[['B']]

          X         Y         Z       new   new_col
B -0.720086  0.265512  0.108549  0.108549  0.217097

In [51]:
df.loc['B']

X         -0.720086
Y          0.265512
Z          0.108549
new        0.108549
new_col    0.217097
Name: B, dtype: float64

In [53]:
#iloc stands for integer location
df.iloc[1]

X         -0.720086
Y          0.265512
Z          0.108549
new        0.108549
new_col    0.217097
Name: B, dtype: float64

In [54]:
df.iloc[[1]]

          X         Y         Z       new   new_col
B -0.720086  0.265512  0.108549  0.108549  0.217097

In [55]:
#Select a specific value using [row,col]
df.loc['B','Y']

0.2655115856921195

In [46]:
df.loc[['A','B'] , ['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [47]:
#We can do other cool stuff with dfs

In [56]:
#We can apply conditional selection
df > 0

       X      Y      Z    new  new_col
A   True  False  False  False    False
B  False   True   True   True     True
C  False   True   True   True     True
D   True   True   True   True     True
E   True   True  False  False    False

In [49]:
bool_df = df > 0

In [51]:
df[bool_df]

          X         Y         Z       new
A  0.628133  0.907969  0.503826  0.503826
B       NaN       NaN  0.605965  0.605965
C  0.740122  0.528813       NaN       NaN
D       NaN       NaN  0.955057  0.955057
E  1.978757  2.605967  0.683509  0.683509

In [52]:
df[df>0]

          X         Y         Z       new
A  0.628133  0.907969  0.503826  0.503826
B       NaN       NaN  0.605965  0.605965
C  0.740122  0.528813       NaN       NaN
D       NaN       NaN  0.955057  0.955057
E  1.978757  2.605967  0.683509  0.683509

In [57]:
df[['X']]>0

       X
A   True
B  False
C  False
D   True
E   True

In [56]:
#Grab all rows where x > 0
#Think of whatever you put in that bracket as the argument to your conditinal selection
df[df['X']>0]

          X         Y         Z       new
A  0.628133  0.907969  0.503826  0.503826
C  0.740122  0.528813 -0.589001 -0.589001
E  1.978757  2.605967  0.683509  0.683509

In [59]:
#Since the result is a dataframe we can make calls on it in one step
#This means, "give me the df where only the rows for which col Z had positive numbers remain, and then get me column X of that"
df[df['Z']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [60]:
df[df['Z']>0][['X']]

          X
A  0.628133
B -0.319318
D -0.758872
E  1.978757

In [61]:
#If you want a df to be returned you can't specify just the row/column label, you need to specify that you want the column of a df using an extra set of brackets

In [64]:
#Breakdown
boolser = df['Z']>0
result = df[boolser]
mycols = ['Y' , 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [65]:
#Using multiple conditions

In [67]:
df[(df['Y']<0) & (df['X']<0.50)]

          X         Y         Z       new
B -0.319318 -0.848077  0.605965  0.605965
D -0.758872 -0.933237  0.955057  0.955057

In [68]:
df[(df['Y']<0) | (df['X']<0.50)]

          X         Y         Z       new
B -0.319318 -0.848077  0.605965  0.605965
D -0.758872 -0.933237  0.955057  0.955057

In [69]:
df

          X         Y         Z       new
A  0.628133  0.907969  0.503826  0.503826
B -0.319318 -0.848077  0.605965  0.605965
C  0.740122  0.528813 -0.589001 -0.589001
D -0.758872 -0.933237  0.955057  0.955057
E  1.978757  2.605967  0.683509  0.683509

In [75]:
df.drop(['level_0'], axis = 1, inplace = True)

In [76]:
df

  index         X         Y         Z       new
0     A  0.628133  0.907969  0.503826  0.503826
1     B -0.319318 -0.848077  0.605965  0.605965
2     C  0.740122  0.528813 -0.589001 -0.589001
3     D -0.758872 -0.933237  0.955057  0.955057
4     E  1.978757  2.605967  0.683509  0.683509

In [77]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [79]:
df['States'] = newind

In [80]:
df

  index         X         Y         Z       new States
0     A  0.628133  0.907969  0.503826  0.503826     CA
1     B -0.319318 -0.848077  0.605965  0.605965     NY
2     C  0.740122  0.528813 -0.589001 -0.589001     WY
3     D -0.758872 -0.933237  0.955057  0.955057     OR
4     E  1.978757  2.605967  0.683509  0.683509     CO

In [83]:
df.set_index('States', inplace = True)

In [85]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [86]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [87]:
inside

[1, 2, 3, 1, 2, 3]

In [88]:
#We use the 
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [90]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [91]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [93]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [94]:
df.index.names = ['Groups','Num']

In [96]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [97]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [98]:
df.loc['G1'].loc[1]['A']

0.3026654485851825

In [100]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [101]:
df.xs(1, level = 'Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Data problems
Data is usually not perfectly clean, issues can occur, data can be missing, values can be wrong. Here we will look at how we can deal with those types of concerns in python using pandas.

In [59]:
import pandas as pd
import numpy as np

In [61]:
d = {'A' : [1,2,np.nan], 'B' : [5, np.nan, np.nan], 'C':[1,2,3]}

In [62]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [108]:
#Drop any row  with a missing value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [109]:
#Drop columns with NaNs
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [110]:
#Drop only those that have two or more NaNs
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [111]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [63]:
#fillna method is to fill the values that appear as NA with something specific
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [113]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [64]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

### See you in the next one!

### - Your MSTS Team